Repository: zerolabnet/SSClash
Catalog: rootfs/po/*/ssclash.po
Languages: ru

source: Configuration
ru: Конфигурация

source: Settings
ru: Настройки

source: Rulesets
ru: Списки правил

source: Servers
ru: Серверы

source: Log
ru: Журнал

source: Please wait
ru: Пожалуйста, подождите

source: Saving...
ru: Сохранение...

source: Deleting...
ru: Удаление...

source: Creating...
ru: Создание...

source: Cancel
ru: Отмена

source: Create
ru: Создать

source: Save
ru: Сохранить

source: Delete
ru: Удалить

source: Open Dashboard
ru: Открыть панель управления

source: Stop Service
ru: Остановить службу

source: Start Service
ru: Запустить службу

source: Clash is running
ru: Clash запущен

source: Clash stopped
ru: Clash остановлен

source: Clash Configuration
ru: Конфигурация Clash

source: Your current Clash config. When applied, the changes will be saved and the service will be restarted.
ru: Ваша текущая конфигурация Clash. При применении изменения будут сохранены, а служба перезапущена.

source: Save & Apply Configuration
ru: Сохранить и применить

source: Unable to start and enable service: %s
ru: Не удалось запустить и включить службу: %s

source: Unable to stop and disable service: %s
ru: Не удалось остановить и отключить службу: %s

source: Popup was blocked. Please allow popups for this site.
ru: Всплывающее окно заблокировано. Пожалуйста, разрешите всплывающие окна для этого сайта.

source: Service is not running.
ru: Служба не запущена.

source: Error opening dashboard:
ru: Ошибка при открытии панели управления:

source: Failed to open dashboard: %s
ru: Не удалось открыть панель управления: %s

source: Configuration saved successfully.
ru: Конфигурация успешно сохранена.

source: Service reloaded successfully.
ru: Служба успешно перезагружена.

source: Unable to save contents: %s
ru: Не удалось сохранить содержимое: %s

source: --- Log truncated, skipped %d older lines ---
ru: --- Лог урезан, пропущено %d старых строк ---

source: Error executing logread:
ru: Ошибка выполнения logread:

source: Error reading logs: %s
ru: Ошибка чтения логов: %s

source: Local Rulesets
ru: Локальные списки правил

source: Create New List
ru: Создать новый список

source: Here you can manage local lists for use in rule-providers. Example usage in your config.yaml: type: file, format: text, path: ./lst/your-list.txt
ru: Здесь вы можете управлять локальными списками для использования в rule-providers. Пример использования в вашем config.yaml: type: file, format: text, path: ./lst/your-list.txt

source: Editor not initialized.
ru: Редактор не инициализирован.

source: List "%s" saved successfully.
ru: Список "%s" успешно сохранен.

source: Failed to save list "%s": %s
ru: Не удалось сохранить список "%s": %s

source: Delete Ruleset
ru: Удалить список правил

source: Are you sure you want to delete the list "%s"? This action cannot be undone.
ru: Вы уверены, что хотите удалить список "%s"? Это действие необратимо.

source: List "%s" has been deleted.
ru: Список "%s" был удален.

source: Failed to delete list "%s": %s
ru: Не удалось удалить список "%s": %s

source: Create New Ruleset
ru: Создать новый список правил

source: e.g., my-custom-list
ru: например, my-custom-list

source: Invalid name. Only letters, numbers, underscores, and hyphens are allowed.
ru: Некорректное имя. Разрешены только буквы, цифры, знак подчеркивания и дефисы.

source: List Name
ru: Имя списка

source: New list "%s" created.
ru: Новый список "%s" создан.

source: Failed to create list: %s
ru: Не удалось создать список: %s

source: Cannot read ruleset directory: %s
ru: Не удается прочитать директорию списков правил: %s

source: A list with this name already exists.
ru: Список с таким именем уже существует.

source: WAN Interfaces
ru: WAN-интерфейсы

source: Ethernet Interfaces
ru: Ethernet-интерфейсы

source: WiFi Interfaces
ru: Wi-Fi интерфейсы

source: USB Interfaces
ru: USB-интерфейсы

source: VPN Interfaces
ru: VPN-интерфейсы

source: Virtual Interfaces
ru: Виртуальные интерфейсы

source: Other Interfaces
ru: Прочие интерфейсы

source: Mihomo Kernel Management
ru: Управление ядром Mihomo

source: Download and manage the Mihomo (Clash Meta) kernel binary.
ru: Загрузка и управление исполняемым файлом ядра Mihomo (Clash Meta).

source: Interface Processing Mode
ru: Режим обработки интерфейсов

source: Choose how to handle network interfaces for proxy processing.
ru: Выберите, как обрабатывать сетевые интерфейсы для проксирования.

source: Automatic Interface Detection
ru: Автоматическое определение интерфейсов

source: Additional Settings
ru: Дополнительные настройки

source: Exclude Mode (Universal approach)
ru: Режим исключения (универсальный)

source: Process traffic from ALL interfaces except selected ones. Automatically detects and excludes WAN. Recommended for most users.
ru: Обрабатывать трафик со всех интерфейсов, кроме выбранных. Автоматически обнаруживает и исключает WAN. Рекомендуется для большинства пользователей.

source: Explicit Mode (Precise control)
ru: Явный режим (точный контроль)

source: Process traffic ONLY from selected interfaces. More secure but requires manual configuration. Recommended for advanced users.
ru: Обрабатывать трафик только с выбранных интерфейсов. Более безопасно, но требует ручной настройки. Рекомендуется для опытных пользователей.

source: Automatically detect LAN bridge interface
ru: Автоматически определять LAN-мост

source: When enabled, automatically finds the main LAN bridge. Disable to manually select specific interfaces.
ru: Если включено, автоматически находит основной LAN-мост. Отключите для ручного выбора интерфейсов.

source: Automatically detect WAN interface
ru: Автоматически определять WAN-интерфейс

source: When enabled, automatically detects and excludes WAN interface. Disable to manually select interfaces to exclude.
ru: Если включено, автоматически обнаруживает и исключает WAN-интерфейс. Отключите для ручного выбора интерфейсов для исключения.

source: Select interfaces to process
ru: Выберите интерфейсы для обработки

source: Traffic from these interfaces will be processed by the proxy.
ru: Трафик с этих интерфейсов будет обработан прокси.

source: Select interfaces to exclude
ru: Выберите интерфейсы для исключения

source: Traffic from these interfaces will bypass the proxy (direct routing).
ru: Трафик с этих интерфейсов будет идти в обход прокси (прямая маршрутизация).

source: Block QUIC traffic (UDP port 443)
ru: Блокировать трафик QUIC (UDP-порт 443)

source: When enabled, blocks QUIC traffic on UDP port 443. This can improve proxy effectiveness for some services like YouTube.
ru: Если включено, блокирует трафик QUIC по порту 443 (UDP). Это может улучшить эффективность прокси для таких сервисов, как YouTube.

source: Kernel Status
ru: Статус ядра

source: Installed
ru: Установлено

source: Not Installed
ru: Не установлено

source: Version
ru: Версия

source: System Architecture
ru: Архитектура системы

source: Latest Available
ru: Последняя доступная

source: Update Available
ru: Доступно обновление

source: Kernel is up to date
ru: Ядро обновлено до последней версии

source: Mihomo kernel binary not found
ru: Исполняемый файл ядра Mihomo не найден

source: Failed to check latest version
ru: Не удалось проверить последнюю версию

source: Error checking status
ru: Ошибка проверки статуса

source: Mihomo (version detected)
ru: Mihomo (версия определена)

source: Installed (%dMB)
ru: Установлено (%d МБ)

source: Download Latest Kernel
ru: Скачать последнее ядро

source: Download Update
ru: Скачать обновление

source: Reinstall Kernel
ru: Переустановить ядро

source: Downloading...
ru: Загрузка...

source: Checking...
ru: Проверка...

source: Refresh Status
ru: Обновить статус

source: Restart Service
ru: Перезапустить службу

source: Save Settings
ru: Сохранить настройки

source: Clear All Interfaces
ru: Очистить выбор

source: Mode: Explicit (process only selected)
ru: Режим: Явный (обрабатывать только выбранные)

source: Mode: Exclude (process all except selected)
ru: Режим: Исключения (обрабатывать все, кроме выбранных)

source: Auto-detected LAN: %s ✓
ru: Авто-определение LAN: %s ✓

source: Auto-detected WAN: %s ✓
ru: Авто-определение WAN: %s ✓

source: Manual selection: %s
ru: Ручной выбор: %s

source: Manual exclusions: %s
ru: Ручные исключения: %s

source: No interfaces configured
ru: Интерфейсы не настроены

source: No exclusions configured
ru: Исключения не настроены

source: Available LAN bridge: %s
ru: Доступный LAN-мост: %s

source: No LAN bridge detected
ru: LAN-мост не обнаружен

source: Available WAN interface: %s
ru: Доступный WAN-интерфейс: %s

source: No WAN interface detected
ru: WAN-интерфейс не обнаружен

source: Settings saved. Please restart the Clash service for changes to take effect.
ru: Настройки сохранены. Для вступления изменений в силу перезапустите службу Clash.

source: Failed to save settings: %s
ru: Не удалось сохранить настройки: %s

source: Clash service restarted successfully.
ru: Служба Clash успешно перезапущена.

source: Failed to restart Clash service: %s
ru: Не удалось перезапустить службу Clash: %s

source: Downloading mihomo kernel...
ru: Загрузка ядра mihomo...

source: Mihomo kernel downloaded and installed successfully!
ru: Ядро Mihomo успешно загружено и установлено!

source: Failed to download mihomo kernel: %s
ru: Не удалось загрузить ядро mihomo: %s

source: Failed to get release information
ru: Не удалось получить информацию о релизе

source: No binary found for architecture: %s
ru: Не найден исполняемый файл для архитектуры: %s

source: Latest release is a pre-release
ru: Последний релиз является предварительным

source: Download failed
ru: Загрузка не удалась

source: Extraction failed
ru: Распаковка не удалась

source: Failed to read /sys/class/net:
ru: Не удалось прочитать /sys/class/net:

source: Failed to execute ip link:
ru: Не удалось выполнить ip link:

source: LuCI network API not available:
ru: Сетевой API LuCI недоступен:

source: LuCI network.getNetworks() not available:
ru: LuCI network.getNetworks() недоступен:

source: No network interfaces found on this system
ru: Сетевые интерфейсы в системе не найдены

source: UCI network detection failed, using fallback:
ru: Определение сети через UCI не удалось, используется резервный метод:

source: Failed to detect LAN bridge via ip command:
ru: Не удалось определить LAN-мост через команду ip:

source: Failed to detect LAN bridge:
ru: Не удалось обнаружить LAN-мост:

source: UCI WAN detection failed, using fallback:
ru: Определение WAN через UCI не удалось, используется резервный метод:

source: Failed to read route table:
ru: Не удалось прочитать таблицу маршрутизации:

source: Failed to detect WAN interface:
ru: Не удалось обнаружить WAN-интерфейс:

source: Failed to detect architecture:
ru: Не удалось определить архитектуру:

source: Failed to get latest release:
ru: Не удалось получить последний релиз:

source: Failed to update kernel status:
ru: Не удалось обновить статус ядра:

source: Failed to update interface checkboxes:
ru: Не удалось обновить флажки интерфейсов:

source: Failed to update auto detect settings:
ru: Не удалось обновить настройки автоопределения:

source: Failed to detect interfaces:
ru: Не удалось обнаружить интерфейсы:

source: Failed to re-detect interfaces:
ru: Не удалось повторно обнаружить интерфейсы:

source: Failed to uncheck detected %s interface:
ru: Не удалось снять выбор с определенного интерфейса %s:

source: Restart Clash service after installing or updating the kernel
ru: Перезапустите службу Clash после установки или обновления ядра

source: Restart Clash service after saving changes
ru: Перезапустите службу Clash после сохранения изменений

source: AUTO
ru: АВТО

source: Local Servers list
ru: Локальный список серверов

source: Add proxy servers links to your local list without converting to Clash format. Add vless://, vmess://, trojan://, h2:// and others.
ru: Добавляйте ссылки на прокси-серверы без конвертации в формат Clash. Поддерживаются vless://, vmess://, trojan://, h2 и другие.

source: How to use
ru: Как использовать

source: 1. Paste your server links (vless://, vmess://, trojan://, etc.) directly into the text area
ru: 1. Вставьте ссылки на серверы (vless://, vmess://, trojan://, и т.д.) прямо в текстовое поле

source: 2. Each server link should be on a separate line
ru: 2. Каждая ссылка на сервер отдельной строкой

source: 3. Click "Save" to update your local server list
ru: 3. Нажмите "Сохранить" для обновления списка локальных серверов

source: 4. The servers will be automatically available in the PROXY group
ru: 4. Серверы автоматически станут доступны в группе PROXY

source: Server Links Editor
ru: Редактор ссылок на серверы

source: Save Servers
ru: Сохранить серверы

source: Clear All
ru: Очистить все

source: Local servers saved successfully!
ru: Локальные серверы успешно сохранены!

source: Failed to save local servers: %s
ru: Не удалось сохранить локальные серверы: %s

source: Clear All Servers
ru: Очистить все серверы

source: Are you sure you want to clear all local servers? This action cannot be undone.
ru: Вы уверены, что хотите очистить все локальные серверы? Это действие необратимо.

source: Failed to clear servers: %s
ru: Не удалось очистить серверы: %s

source: Cannot read local servers file: %s
ru: Не удается прочитать файл локальных серверов: %s
